---
kind: method
id: M:Autodesk.Revit.DB.Events.DocumentChangedEventArgs.GetAddedElementIds
source: html/7c29dc98-3f86-4b2a-84a2-02709d588d5d.htm
---
# Autodesk.Revit.DB.Events.DocumentChangedEventArgs.GetAddedElementIds Method

Returns set of elements newly added to the document.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetAddedElementIds()
```

## Returns
The set of ElementId for elements newly added to the document.